Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_179-Teaching_The_Relative_and_Ultimate_Truths-v1.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་མི་སྐྱེ་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་སློབ་པའི་ཆོས་རྣམས་ཀྱང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn on the ultimate level is also ultimately the same as the dharmas of those who are training.

source: ཤིན་ཏུ་མི་སྐྱེ་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་མི་སློབ་པའི་ཆོས་རྣམས་ཀྱང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn on the ultimate level is also ultimately the same as the dharmas of those who are no longer training.

source: ཤིན་ཏུ་མི་སྐྱེ་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn on the ultimate level is also ultimately the same as the dharmas of the completely perfect Buddha.

source: དོན་དམ་པར་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་དེ་བཞིན་ཉིད་དང་།
en: “Whatever is the same as the dharmas of the completely perfect Buddha on the ultimate level is also ultimately the same as suchness,

source: ཤིན་ཏུ་མི་སྐྱེ་བའང་དེ་དང་མཉམ་མོ། །
en: and the utterly unborn.

source: དོན་དམ་པར་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་མྱ་ངན་ལས་འདས་པ་ཡང་དེ་དང་མཉམ་མོ། །
en: “Whatever is the same as the dharmas of the completely perfect Buddha on the ultimate level is also ultimately the same as nirvāṇa.

source: དོན་དམ་པར་ན་མྱ་ངན་ལས་འདས་པ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་འཁོར་བ་ཡང་དེ་དང་མཉམ་མོ། །
en: “Whatever is the same as nirvāṇa on the ultimate level is also ultimately the same as saṃsāra.

source: དོན་དམ་པར་ན་འཁོར་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དེ་དང་མཉམ་མོ། །
en: “Whatever is the same as saṃsāra on the ultimate level is also ultimately the same as affliction.

source: དོན་དམ་པར་ན་ཀུན་ནས་ཉོན་མོངས་པ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་རྣམ་པར་བྱང་བ་ཡང་དེ་དང་མཉམ་མོ། །
en: “Whatever is the same as affliction on the ultimate level is also ultimately the same as purification.

source: དོན་དམ་པར་ན་རྣམ་པར་བྱང་བ་གང་དང་མཉམ་པ། དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་མཉམ་མོ། །
en: “Whatever is the same as purification on the ultimate level is also ultimately the same as all phenomena.

source: དེ་ལྟར་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་ཡང་དག་པར་སྦྱོར་བའི་དགེ་སློང་ནི་
en: “A monk who genuinely engages in the equality of all phenomena on the ultimate level in this way,

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཡང་དག་པར་སྦྱོར་བ་ཞེས་བྱ་སྟེ་ཇི་སྐད་བརྗོད་པ་བཞིན་དུ་ནི་མ་ཡིན་ནོ། །
en: divine son, is called one with authentic engagement on the ultimate level. However, it is not like the way it is expressed.”

source: འཇམ་དཔལ་མཉམ་པ་ཉིད་གང་གིས་དོན་དམ་པར་ན་རྣམ་པར་བྱང་བའི་བར་དུ་གང་དང་མཉམ་པ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་མཉམ་ཞེས་བྱ།
en: “Mañjuśrī, what is the sameness by which everything up to purification is said to be ultimately the same, and also to be ultimately the same as all phenomena?”

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མི་འབྱུང་བར་མཉམ་པ་དང་།
en: “Ultimately, all phenomena are the same in that they are unarisen.

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མི་སྐྱེ་བར་མཉམ་པ་དང་།
en: Ultimately, all phenomena are the same in that they are unborn.

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དངོས་པོ་མེད་པར་མཉམ་པས།
en: Ultimately, all phenomena are the same in that they are unreal.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་མཉམ་མོ། །
en: Therefore, divine son, ultimately all phenomena are the same.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཤིན་ཏུ་མི་འབྱུང་བ་ཉིད་ཀྱི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཐ་དད་དུ་བྱ་བ་མེད་དོ། །
en: Since ultimately, divine son, all phenomena are unarisen, they cannot be distinguished.

source: ལྷའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Divine son, it is like this analogy.

source: ཁམ་པའི་སྣོད་ཀྱི་ནང་གི་ནམ་མཁའ་གང་ཡིན་པ་དང་།
en: The space within a clay vessel

source: རིན་པོ་ཆེའི་སྣོད་ཀྱི་ནང་གི་ནམ་མཁའ་གང་ཡིན་པ་དེ་ནི་ནམ་མཁའི་ཁམས་ཉིད་ཡིན་ཏེ།
en: and the space within a precious vessel are both the element of space;

source: དེ་ལ་དོན་དམ་པར་ན་ཆུང་ཟད་ཀྱང་ཐ་དད་དུ་བྱ་བ་མེད་དོ། །
en: ultimately, not the slightest distinction can be made between them.

source: ལྷའི་བུ་དེ་བཞིན་ཉིད་དུ་
en: Divine son, in the very same way,

source: ཉོན་མོངས་པ་གང་ཡིན་པ་དེ་དོན་དམ་པར་ན་ཤིན་ཏུ་མི་འབྱུང་བ་ཉིད་དོ། །
en: disturbing emotions are themselves unarisen on the ultimate level.

source: རྣམ་པར་བྱང་བ་གང་ཡིན་པ་དེ་ཡང་དོན་དམ་པར་ན་ཤིན་ཏུ་མི་འབྱུང་བ་ཉིད་དོ། །
en: Purification itself is also unarisen on the ultimate level.

source: དོན་དམ་པར་ན་འཁོར་བ་ཡང་ཤིན་ཏུ་མི་འབྱུང་བ་ཉིད་དོ། །
en: Ultimately, saṃsāra itself is also unarisen.

source: དོན་དམ་པར་ན་མྱ་ངན་ལས་འདས་པའི་བར་དུ་ཡང་ཤིན་ཏུ་མི་འབྱུང་བ་ཉིད་དོ། །
en: Ultimately, all phenomena up through nirvāṇa itself are unarisen.

source: འདི་ལ་དོན་དམ་པར་ན་ཐ་དད་དུ་བྱ་བ་ཆུང་ཟད་ཀྱང་མེད་དོ། །
en: Ultimately, not even a slight distinction can be made with respect to these.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། །
en: And why?

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མི་འབྱུང་བའི་ཕྱིར་རོ། །
en: Because ultimately all phenomena are unarisen.”

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཕགས་པའི་བདེན་པ་དག་ལ་ཇི་ལྟར་བརྩོན་པར་བྱ།
en: “Mañjuśrī, how should bodhisattva great beings exert themselves with respect to the truths of the noble ones?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། །
en: Mañjuśrī said,

source: ལྷའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་བདེན་པ་དག་ལ་བརྩོན་པར་མི་བྱེད་ན།
en: “Divine son, if bodhisattva great beings did not apply themselves to the truths of the noble ones,

source: ཇི་ལྟར་ཉན་ཐོས་རྣམས་ལ་མི་སྟོན་པའི་ཚུལ་གྱིས་ཆོས་སྟོན། །
en: how could they teach, without teaching, the Dharma to the hearers?

source: ལྷའི་བུ་དེ་ལྟ་མོད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདེན་པ་སྒོམ་པ་ནི་ལྟ་བ་དང་བཅས་པའོ། །
en: Yet, divine son, although indeed that is the case, the bodhisattva great beings’ meditation on the truths involves consideration,

source: ཉན་ཐོས་ཀྱི་བདེན་པ་སྒོམ་པ་ནི་མི་ལྟ་བའོ། །
en: while the hearers’ meditation on the truths does not involve consideration.

source: ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཀུན་རྫོབ་ཏུ་སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བ་སྟེ། །
en: Divine son, on the relative level the bodhisattva great beings consider all sentient beings.

source: བདེན་པ་རྣམས་མི་སྒོམ་པའི་ཚུལ་གྱིས་ཀྱང་སྒོམ་མོད་ཀྱི།
en: Although they do meditate on the truths without meditating,

source: དངོས་པོ་མེད་པར་དམིགས་པའི་རྣམ་པས་ཡང་དག་པ་ཉིད་ཀྱི་མཐའ་དེ་ཡང་མངོན་དུ་མི་བྱེད་དོ། །
en: they do not actualize the limit of reality by focusing on lack of substance.

source: ཀུན་རྫོབ་ཏུ་ཐབས་མཁས་པ་བསྒྲུབ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་བདེན་པ་རྣམས་ལ་མི་སྒོམ་པའི་ཚུལ་གྱིས་སྒོམ་མོ། །
en: On the relative level, in order to acquire skill in means, the bodhisattva great beings meditate on the truths without meditating.

source: ཀུན་རྫོབ་ཏུ་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བདེན་པ་ཡང་མི་འདོར་ལ།
en: On the relative level they do not discard the truths of saṃsāra, nor of nirvāṇa.

source: ཀུན་རྫོབ་ཏུ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་སོ་སོར་བརྟག་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་བདེན་པ་རྣམས་ལ་མི་སྒོམ་པའི་ཚུལ་གྱིས་ཀྱང་སྒོམ་མོ། །
en: On the relative level, in order to individually discriminate the wisdoms of the buddhas, the bodhisattva great beings meditate on the truths without meditating.

source: ལྷའི་བུ་འདི་ལྟ་སྟེ།
en: “Divine son, it is as in the following analogy.

source: དཔེར་ན་འདྲོན་པ་མང་པོ་བཅིངས་ནས་སྐྱེས་བུ་གཅིག་བྲོས་ཏེ། འདྲོན་པ་མང་པོའི་ནང་ནས་བྱུང་ནས།
en: A person who had been caught by many strangers

source: འབྲོག་དགོན་པར་ཞུགས་པ་དང་།
en: He escapes from among those many strangers and enters a jungle.

source: དེ་ཡིད་འཇིགས་ཤིང་སྐྲག་ནས་ཕྱིར་མི་ལྡོག་པར་འབྲོག་དགོན་པ་ལས་འདས་སོ། །
en: But he becomes frightened, panics, and leaves the jungle, never to return.

source: ལྷའི་བུ་དེ་བཞིན་དུ་ཉན་ཐོས་རྣམས་འཁོར་བས་འཇིགས་ཤིང་སྐྲག་ནས་འཁོར་བ་ལས་བྲོས་ཏེ།
en: Divine son, in the same way the hearers are frightened of saṃsāra and flee in panic.

source: འཇིག་རྟེན་འདིར་ཕྱིར་མི་འོང་ཞིང་གཅིག་པུ་གཉིས་སུ་མེད་པར་བདེན་པ་སྒོམ་སྟེ།
en: They do not return to this world but meditate one-pointedly on the truths in solitude.

source: ཐབས་ཀྱི་རིགས་པ་དང་བྲལ་བས་སེམས་ཅན་ཐམས་ཅད་ལ་མི་ལྟ་བ་ནས་
en: Thus, since they lack the intelligence of various methods, they do not consider all sentient beings,

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་ལ་མི་ལྟ་བའོ། །
en: and so forth up to not considering the wisdom of omniscience.

source: དཔེར་ན་དེད་དཔོན་གཡོག་མང་པོ་ལམ་རྒྱགས་ཐམས་ཅད་འབྱོར་པ།
en: A leader acquires many servants and all necessary provisions.

source: ཟོང་ཆེན་པོ་བསྡུ་བའི་ཕྱིར་འགྲོའོ་སྙམ་ནས་སྐྱེ་བོ་མང་པོ་བསྡུས་ཏེ།
en: Thinking that he should set out to gather many goods, he rounds up many people and, without fear or panic,

source: དེ་འཇིགས་ཤིང་སྐྲག་པ་མེད་པར་འབྲོག་དགོན་པ་དེ་ལས་འདའོ། །
en: he leaves the wild forest.

source: ལྷའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཀུན་རྫོབ་ཏུ་དེད་དཔོན་ཆེན་པོ་ལྟར་འཇིག་རྟེན་གྱི་སྤྱོད་པས།
en: Similarly, divine son, the bodhisattva great beings resemble that great leader as they engage in worldly conduct on the relative level.

source: སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བ།
en: Thereby, they provide for all sentient beings and engage with great compassion,

source: གཡོག་མང་པོ་སྙིང་རྗེ་ཆེན་པོའི་སྦྱོར་བ་ཅན།
en: which can be likened to the many servants.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་ལམ་རྒྱགས་འབྱོར་པ།
en: They acquire all the roots of virtue, which are the provisions.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་།
en: They possess the great profit that is comprised of the six perfections,

source: བསྡུ་བའི་དངོས་པོས་ཡོངས་སུ་བཟུང་ཞིང་བླ་ན་མེད་པའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཡང་དག་པར་བསྡུ་བའི་ཁེ་ཆེན་པོ་དང་ལྡན་པ་ཡང་
en: the means of attracting disciples, and unsurpassed merit and wisdom.

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དོན་བྱེད་ཅིང་།
en: They act for the welfare of all realms of sentient beings

source: སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ།
en: and proceed from buddha realm to buddha realm.

source: སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་གྱུར་ཅིང་ཐབས་ལ་མཁས་པས་བདེན་པ་རྣམས་ལ་སྒོམ་མོ། །
en: Thus, they provide for sentient beings and meditate on the truths through being skilled in means.

source: དཔེར་ན་ཤ་ནའི་རས་ལ་མེ་ཏོག་ཙམ་པ་ཀ་དང་མེ་ཏོག་འབར་ཤི་ཀས་བསྒོས་ན་དེའི་དྲི་མྱུར་དུ་ཡལ་བར་འགྱུར་རོ། །
en: If one infuses a hempen cloth with campaka and vārṣika flowers, their scent fades quickly.

source: ལྷའི་བུ་དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་བདེན་པ་ལ་སྒོམ་པ་ནི་ཡུན་ཐུང་བར་བལྟ་སྟེ།
en: Divine son, similarly, the hearers’ meditation on the truths is observed for just a short period of time.

source: དེ་མྱུར་དུ་མྱ་ངན་ལས་འདས་ནས་སངས་རྒྱས་ཀྱི་ཚུལ་ཁྲིམས་དང་།
en: Passing quickly into nirvāṇa, they do not bring forth the fragrance of the buddhas’ discipline,

source: ཐོས་པ་དང་།
en: hearing,

source: ཏིང་ངེ་འཛིན་དང་།
en: absorption,

source: ཤེས་རབ་དང་
en: knowledge,

source: ཡེ་ཤེས་ཀྱི་དྲི་ཡང་མི་འབྱིན།
en: and wisdom.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཡང་སྤོང་མི་ནུས་སོ། །
en: Furthermore, they are unable to relinquish the disturbing emotions that are conjoined with the habitual tendencies.

source: དཔེར་ན་ཡུལ་ཀ་ཤི་ཀའི་གོས་རིན་པོ་ཆེ་ལ།
en: If one were to infuse a cloth of precious Benares silk

source: མི་དང་ལྷའི་སྤོས་དང་། མེ་ཏོག་གི་དྲིས་བསྐལ་པ་ཆེན་པོ་བརྒྱ་སྟོང་དུ་བསྒོས་ན།
en: for hundreds of thousands of great aeons with the scent of perfume and flowers from the human and divine realms,

source: དེའི་ལྷའི་དྲི་དེ་རྟག་ཏུ་བྲོ་ཞིང་།
en: its divine fragrance would be experienced in perpetuity,

source: དྲི་གཙང་མས་ལྷ་དང་མི་ཟིལ་གྱིས་གནོན་ཏོ། །
en: and that pure aroma would overwhelm both gods and men.

source: ལྷའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདེན་པ་སྒོམ་པ་མི་སྒོམ་པའི་ཚུལ་གྱིས་བསྐལ་པ་བརྒྱ་སྟོང་གྲངས་མེད་པར་བསྒོམས་པ་ནི།
en: Divine son, similarly, the bodhisattva great beings without meditating meditate on the truths for incalculably many hundreds of thousands of eons.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་ཐོབ་ཀྱི་བར་དུ་བར་མ་དོར་དེ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་འདི་ལྟ་སྟེ།
en: They do not relinquish doing so until they have attained omniscient wisdom endowed with the supreme of all aspects and pass into complete nirvāṇa.

source: རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་དྲི་མི་དམིགས་པའི་ཚུལ་གྱིས་ཤིན་ཏུ་དྲི་ཞིམ་པར་འགྱུར་རོ། །
en: And so, without reference points, they become exceedingly fragrant with the scent of omniscient wisdom endowed with the supreme of all aspects.

source: འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་ཀྱང་སྤོང་ཞིང་།
en: In terms of worldly conventions, they abandon all their habitual tendencies toward the disturbing emotions

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་རྣམས་ཀྱང་འདུ་བར་འགྱུར་རོ། །
en: and attract the worlds of gods, men, and demigods.”

source: དེ་ནས་ལྷའི་བུ་རབ་ཏུ་ཞི་བ་རྣམ་པར་དུལ་བའི་དབང་ཕྱུག་གིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the god Lord of Peace and Calm asked Mañjuśrī

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དེ་ཅི་འདྲ།
en: Kumārabhuta, “Mañjuśrī, how is the spiritual community of hearers that belong to the Blessed, thus-gone, worthy, perfect Buddha Ratnaketu?”

source: དོན་དམ་པར་ན་དད་པའི་རྗེས་སུ་འགྲོ་བ་ཡང་མ་ཡིན།
en: “Ultimately, they are not devoted followers,

source: གཞན་ལ་དད་པས་འགྲོ་བ་ཡང་མ་ཡིན་ནོ། །
en: but they are also not devotedly turning to someone else.

source: དོན་དམ་པར་ན་རིགས་ཀྱི་རྗེས་སུ་འགྲོ་བ་ཡང་མ་ཡིན་ཏེ། དོན་དམ་པར་ན་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱང་མི་གཏོང་ངོ་། །
en: Ultimately, they are not followers of the family, but neither do they ultimately abandon the family of the Thus-gone One.

source: དོན་དམ་པར་ན་ཆོས་ཀྱི་རྗེས་སུ་འགྲོ་བ་ཡང་མ་ཡིན་ཏེ། དོན་དམ་པར་ན་ཆོས་གང་ཡང་མི་དམིགས་སོ། །
en: Ultimately, they are not following the Dharma; indeed, ultimately they do not observe any Dharma at all.

source: དོན་དམ་པར་ན་བརྒྱད་པ་ཡང་མ་ཡིན་ཏེ། ཀུན་རྫོབ་ཏུ་ན་ལོག་པའི་ཆོས་བརྒྱད་དང་ཡང་བྲལ་ལོ། །
en: Ultimately, they do not possess the eight mistaken dharmas, but neither are they relatively free from them.

source: དོན་དམ་པར་ན་རྒྱུན་དུ་ཞུགས་པ་ཡང་མ་ཡིན་ཏེ། འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱི་བདེན་པར་ན་ངན་སོང་ཐམས་ཅད་ལས་ཀྱང་འདས་སོ། །
en: “Ultimately they are not stream-enterers, yet in terms of the conventional truth of the world, they are beyond all the lower realms.

source: དོན་དམ་པར་ན་ལན་ཅིག་ཕྱིར་འོང་བ་ཡང་མ་ཡིན་ཏེ། ཀུན་རྫོབ་ཏུ་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡང་འོང་ངོ་། །
en: Ultimately they are not once-returners, yet relatively they do return in order to ripen beings.

source: དོན་དམ་པར་ན་ཕྱིར་མི་འོང་བ་ཡང་མ་ཡིན་ཏེ། ཀུན་རྫོབ་ཏུ་ན་ཆོས་ཐམས་ཅད་ལས་འོང་བ་མེད་དོ། །
en: Ultimately they are not non-returners, yet relatively from all phenomena there is no return.

source: དོན་དམ་པར་ན་དགྲ་བཅོམ་པ་ཡང་མ་ཡིན་ཏེ།
en: Ultimately they are not worthy ones,

source: འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་བླ་ན་མེད་པའི་མཆོད་པར་འོས་པ་ཡང་ཡིན་ནོ། །
en: yet according to worldly conventions they are supremely worthy of veneration by the world along with its gods.

source: དོན་དམ་པར་ན་ཉན་ཐོས་ཀྱང་མ་ཡིན་ཏེ།
en: Ultimately they are not hearers,

source: མི་དམིགས་པའི་ཚུལ་གྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལས་ཐོས་པ་ཡང་འཛིན་ཏོ། །
en: yet, without conceptually apprehending them, they do listen to all the blessed buddhas.

source: དོན་དམ་པར་ན་འདོད་ཆགས་དང་བྲལ་བ་ཡང་མ་ཡིན་ཏེ།
en: “Ultimately they are not without attachment,

source: ཀུན་རྫོབ་ཏུ་ན་འདོད་ཆགས་ཀྱི་ཡོངས་སུ་གདུང་བས་ཀྱང་མི་གདུང་ངོ་། །
en: yet relatively they are unharmed by the torments of attachment.

source: དོན་དམ་པར་ན་ཞེ་སྡང་དང་བྲལ་བ་ཡང་མ་ཡིན་ཏེ།
en: Ultimately they are not without anger,

source: ཀུན་རྫོབ་ཏུ་ན་ཞེ་སྡང་གི་ཡོངས་སུ་གདུང་བས་ཀྱང་མི་གདུང་ངོ་། །
en: yet relatively they are unharmed by the torments of anger.

source: དོན་དམ་པར་ན་གཏི་མུག་དང་བྲལ་བ་ཡང་མ་ཡིན་ཏེ།
en: Ultimately they are not without delusion,

source: ཀུན་རྫོབ་ཏུ་ན་ཆོས་ཐམས་ཅད་མུན་པ་མུན་ནག་དང་བྲལ་བའོ། །
en: yet relatively all phenomena are free from darkness.

source: དོན་དམ་པར་ན་ཉོན་མོངས་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་ཏེ།
en: Ultimately they are not without disturbing emotions,

source: ཀུན་རྫོབ་ཏུ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་གདུལ་བའི་ཕྱིར་ཡང་བརྩོན་ནོ། །
en: yet relatively they endeavor to tame the disturbing emotions of all beings.

source: དོན་དམ་པར་ན་ཐོག་མ་ནས་མ་སྐྱེས་པ་ངེས་པར་ཞུགས་ཀྱང་
en: Ultimately they have abided definitively in non-origination from the very beginning,

source: ཀུན་རྫོབ་ཏུ་ན་བསམས་བཞིན་དུ་སྲིད་པ་ལེན་ཏོ། །
en: yet relatively they consciously take up existence.

source: ཀུན་རྫོབ་ཏུ་ན་འཁོར་བ་ཡང་ཡོངས་སུ་འཛིན་མོད་ཀྱི།
en: Relatively they embrace cyclic existence,

source: དོན་དམ་པར་ན་ཆོས་གང་ཡང་ཡོངས་སུ་འཛིན་པ་དང་གཏོང་བ་ཡང་མེད་དོ། །
en: yet ultimately there is no grasping to or abandoning of any phenomenon.

source: དེ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དྲན་པ་དང་བྲལ་བར་མི་མཐོང་བས་མཐོང་བ་སྟེ།
en: “Ultimately, without intense mindfulness regarding all phenomena, they see without seeing.

source: ཀུན་རྫོབ་ཏུ་ན་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་སྒོམ་མོ། །
en: Relatively, however, they train in the foundations of mindfulness.

source: དེ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་སྐྱེས་མ་འགགས་པར་མི་ཤེས་པའི་ཚུལ་གྱིས་ཀྱང་རབ་ཏུ་ཤེས་ལ།
en: Ultimately, without knowing, they know that all phenomena are unborn and unceasing.

source: འཇིག་རྟེན་གྱི་སྤྱོད་པར་ན་ཡང་དག་པར་སྤོང་བ་རྣམས་ཀྱང་སྒོམ་མོ། །
en: In terms of worldly experience, however, they train in the thorough relinquishments.

source: དེ་དོན་དམ་པར་ན་ལུས་དང་སེམས་མེད་པ་ཡང་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱི་བདེན་པར་ན་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ཀྱང་སྒྲུབ་བོ། །
en: Ultimately, they have neither body nor mind yet, in the relative truth of the world, they have accomplished the bases of miraculous power.

source: དེ་དོན་དམ་པར་ན་དབང་པོ་ཐམས་ཅད་དང་བྲལ་ཡང་
en: Ultimately they are without any faculties,

source: ཀུན་རྫོབ་ཏུ་ན་དབང་པོ་རྣམས་ཀྱང་སྒྲུབ་བོ། །
en: yet relatively they have accomplished all the faculties.

source: དེ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་རབ་ཏུ་དངོས་པོ་མེད་པར་མི་མཐོང་བའི་ཚུལ་གྱིས་མཐོང་ཡང་
en: Ultimately, without seeing, they see that all phenomena are unreal.

source: ང་རྒྱལ་ཅན་དམིགས་པ་ཅན་ཐམས་ཅད་ཚར་གཅོད་པའི་ཕྱིར་
en: However, in order to eradicate the conceit and conceptual apprehension of everyone who is conceited and engages in conceptual apprehension,

source: མི་སྒོམ་པའི་ཚུལ་གྱིས་སྟོབས་ཀྱང་སྒོམ་མོ། །
en: they train, without training, in the power‌s.

source: དེ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དངོས་པོ་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་
en: Ultimately, in order to make it understood that all phenomena are unreal,

source: མི་སྒོམ་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱང་སྒོམ་མོ། །
en: they train, without training, in the branches of awakening.

source: དེ་དོན་དམ་པར་ན་ཤིན་ཏུ་དངོས་པོ་མེད་ཀྱང་ཀུན་རྫོབ་ཏུ་ན་སྒོམ་པའི་ཚུལ་གྱིས་ལམ་ཡང་སྒོམ་མོ། །
en: Although ultimately utterly unreal, relatively they train in the path by means of not training.

source: དེ་དོན་དམ་པར་ན་ཡང་དག་པའི་མཐའ་ལ་ཞི་གནས་མངོན་པར་སྒྲུབ་བོ། །
en: Ultimately, they accomplish tranquillity within the limit of reality.

source: དེ་དོན་དམ་པར་ན་ལྷག་མཐོང་ཤིན་ཏུ་མི་སྐྱེ་བར་མི་སྒོམ་པའི་ཚུལ་གྱིས་མཐོང་ངོ་། །
en: Ultimately, by not training, they see insight to be utterly unarisen.

source: དེ་དོན་དམ་པར་ན་མ་རིག་པ་ཟད་པ་ཉིད་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་རིག་པ་སྐྱེད་དེ།
en: Ultimately, their knowledge is born through not apprehending ignorance as something to be exhausted.

source: དོན་དམ་པར་ན་ཟད་པའམ་སྐྱེ་བ་མི་དམིགས་སོ། །
en: Ultimately, neither exhaustion nor arising is observed.

source: དེ་ཤའི་མིག་གིས་སེམས་ཅན་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱང་མཐོང་ལ་དེ་དོན་དམ་པར་ན་ཅི་ཡང་མི་མཐོང་ངོ་། །
en: “Although they see all beings and all buddha realms with their physical eye, ultimately they see nothing whatsoever.

source: དེ་ལྷའི་མིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཆི་འཕོ་དང་སྐྱེ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་ཡང་དོན་དམ་པར་ན་ཅི་ཡང་མི་མཐོང་ངོ་། །
en: Although they see all the deaths, transmigrations, and rebirths of all beings so clearly with their divine eye, ultimately they see nothing whatsoever.

source: དེ་ཤེས་རབ་ཀྱི་མིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་། གཡོ་བ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཀྱང་དོན་དམ་པར་ན་ཅི་ཡང་མི་ཤེས་སོ། །
en: Although they know all the experiences and movements of the minds of all beings with their eye of wisdom, ultimately they know nothing whatsoever.

source: དེ་ཆོས་ཀྱི་མིག་གིས་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་ཡང་དོན་དམ་པར་ན་ཆོས་ཅི་ཡང་མི་མཐོང་ངོ་། །
en: Although they see all dharmas with their dharma eye, ultimately they see nothing whatsoever.

source: དེ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་ཐམས་ཅད་བྱེད་ཀྱང་དོན་དམ་པར་ན་ཅི་ཡང་མི་བྱེད་དོ། །
en: Although they perform all the acts of a buddha with their buddha eye, ultimately they perform nothing whatsoever.

source: དེ་ལྷའི་རྣ་བས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་ཆོས་བསྟན་པ་ཐོས་ཀྱང་དོན་དམ་པར་ན་ཅི་ཡང་མི་ཐོས་སོ། །
en: Although with their divine ear they hear the teachings of all the blessed buddhas, ultimately they hear nothing whatsoever.

source: དེ་སེམས་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ལྟ་ཡང་དོན་དམ་པར་ན་ཅི་ཡང་མི་ལྟའོ། །
en: Although with their single mind they view the minds of all beings, ultimately they view nothing whatsoever.

source: དེ་རྗེས་སུ་དྲན་པའི་ཡེ་ཤེས་ཀྱིས་སྔོན་གྱི་མཐའ་ཡང་རྗེས་སུ་དྲན་མོད་ཀྱི་དོན་དམ་པར་ན་ཅི་ཡང་མི་དྲན་ནོ། །
en: Although with their wisdom of recollection they surely recollect the very dawn of time, ultimately they recollect nothing whatsoever.

source: དེ་རྫུ་འཕྲུལ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པར་འགྲོ་ཡང་དོན་དམ་པར་ན། འོང་བའམ་འགྲོ་བ་མེད་དོ། །
en: Although they visit the inconceivable buddha realms by means of their miraculous powers, ultimately there is no coming or going.

source: དེ་ནི་ཟག་པ་ཟད་ཀྱང་དོན་དམ་པར་ན་ཟད་པའི་ཆོས་ཅན་མ་ཡིན་ནོ། །
en: Although their defilements are exhausted, ultimately there is nothing to be exhausted.

source: སྣང་ཡང་སྣང་ལ་དོན་དམ་པར་ན་དེའི་ལུས་ཡོངས་སུ་གྲུབ་པ་ཡང་མེད་དོ། །
en: “Although they appear as beings, ultimately their bodies are devoid of true existence.

source: སྨྲ་ཡང་སྨྲ་ལ་དོན་དམ་པར་ན་ཡི་གེར་ཡང་མི་བརྗོད་དོ། །
en: Although they speak, ultimately their speech is not pronounced in the form of syllables.

source: སེམས་ཀྱང་སེམས་ལ་དོན་དམ་པར་ན་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་སུ་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: Although they think, ultimately thought is not something that can be expressed as mind or mental phenomena.

source: དོན་དམ་པར་ན་གཟུགས་སུ་ཡང་མི་སྣང་ལ་ཀུན་རྫོབ་ཏུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ནི་བརྒྱན།
en: Ultimately they do not appear as form, but relatively they are adorned with the thirty-two marks and ornamented with the excellent signs of great beings.

source: དཔེ་བྱད་བཟང་པོས་ནི་སྤྲས། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱིས་ནི་བརྒྱན།
en: They are adorned with the accumulations of merit and wisdom.

source: གཟི་བརྗིད་ནི་བསྙེན་པར་དཀའ།
en: Their splendor is dazzling.

source: བརྗོད་པ་ནི་རྣམ་པར་བསྒྲགས།
en: Their speech resounds.

source: ཚུལ་ཁྲིམས་ཀྱི་བྱུག་པས་ནི་བྱུགས།
en: They have been anointed with the unguent of discipline.

source: ངན་དུ་སྨྲ་བའི་ཚིག་རྣམས་ཀྱིས་ནི་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་མེད།
en: Words spoken with ill intent cause them no disturbing emotions.

source: མངོན་པར་ཤེས་པས་ནི་རྣམ་པར་རོལ།
en: They sport in clairvoyant powers.

source: ཐོས་པས་ནི་རྣམ་པར་ཤིགས།
en: Their learning sets them free.

source: སྤོབས་པས་ནི་རབ་ཏུ་སྒྲོག །
en: With their eloquence they make declarations.

source: ཀུན་རྫོབ་ཏུ་ན་ཡེ་ཤེས་ཀྱིས་ནི་རྣམ་པར་འཕྲུལ།
en: “Relatively, they produce emanations by means of wisdom;

source: ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་ནི་མུན་པ་མུན་ནག་སེལ།
en: with the light of wisdom they dispel all darkness;

source: ཤེས་རབ་ཀྱིས་ནི་སྣང་བར་བྱེད།
en: with knowledge they illuminate;

source: མཐའ་ཡས་པར་བསྟན་པ་ནི་རྟོགས་པར་ཁོང་དུ་ཆུད་དོ། །
en: their teaching knows no limit, and is assimilated as realization.

source: ཀུན་རྫོབ་ཏུ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནི་སྐྱབས།
en: Relatively, for all beings they are the refuge, and because of their awakening they constantly consider beings—

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ནི་རྟག་ཏུ་གཟིགས།
en: who are continuously beheld by the blessed buddhas,

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། མུ་སྟེགས་ཅན་དམིགས་པ་ཅན་ཐམས་ཅད་ཀྱིས་ནི་མི་བལྟ་ཞིང་བྱང་ཆུབ་ཀྱི་ཕྱིར་ནི་རྟག་ཏུ་བལྟ་བ་སྟེ།
en: but who are not considered by the hearers, solitary buddhas, and the extremists with reference points— so that,
